org/python.org
:PROPERTIES:
:ID:       d69d1f3d-2a3f-48bd-a59c-0bb631b0430b
:END:
#+title: Python

Python is an interpreted, general-purpose, high-level programming language. Some
properties of Python include:

- whitespaces being significant
- dynamically-typed
- garbage-collected

* Python Import Resolution
:PROPERTIES:
:ID:       a0953ce4-ac19-4bb7-89b5-3f621afb1da4
:END:
Say you have a Python import statement:

#+begin_src python
import abc
#+end_src

Python will look up the following in order:

1. [[https://docs.python.org/3/library/sys.html#sys.modules][sys.modules]]: this is the cache containing previously imported modules
2. built-in modules
3. [[https://docs.python.org/3/library/sys.html#sys.path][sys.path]]: Usually includes the current directory

* Python Default Parameter Values
:PROPERTIES:
:ID:       dbe3e971-4146-46c4-a66a-5b66db4d23a9
:END:
- source :: [[http://effbot.org/zone/default-values.htm][Default Parameter Values in Python]]

Python has interesting behaviour for default values:

#+begin_src python :results output
  def a(v=[]):
      v.append(1)
      print(v)

  a()
  a()
  a()
  a()
#+end_src

#+results:
: [1]
: [1, 1]
: [1, 1, 1]
: [1, 1, 1, 1]

Why does this happen? Default parameter values are always evaluated
when, and only when, the “def” statement they belong to is executed.
Also note that “def” is an executable statement in Python, and that
default arguments are evaluated in the “def” statement’s environment.
If you execute “def” multiple times, it’ll create a new function
object (with freshly calculated default values) each time.

* TODO Python Decorators
:PROPERTIES:
:ID:       c22185a2-5de6-4429-8215-819b1cb45bc4
:END:
* Books
** TODO [[https://www.goodreads.com/book/show/22800567-fluent-python?ac=1&from_search=true&qid=Fo3rzgCJBZ&rank=1][Fluent Python]]
** TODO  [[https://www.goodreads.com/book/show/23020812-effective-python][Effective Python]]
** TODO [[https://www.goodreads.com/book/show/17802644-high-performance-python?ac=1&from_search=true&qid=IniMBn35h2&rank=1][High Performance Python]]

* TODO Links
- [[https://github.com/mahmoud/awesome-python-applications][mahmoud/awesome-python-applications]]
- [[https://google.github.io/styleguide/pyguide.html][styleguide | Style guides for Google-originated open-source projects]]
- [[https://github.com/psf/black][psf/black]]
- [[https://gregoryszorc.com/blog/2019/01/10/what-i've-learned-about-optimizing-python/][Gregory Szorc's Digital Home | What I've Learned About Optimizing Python]]
- [[https://github.com/benfred/py-spy][benfred/py-spy: Sampling profiler for Python programs]]
